swak4foam/Examples/groovyBC/potentialPitzDaily/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            groovyBC;;
        value           uniform (10 0 0);
        variables (
            "minY=min(pts().y);"
            "maxY=max(pts().y);"
            "minZ=min(pts().z);"
            "maxZ=max(pts().z);"
            "profileY=4*(pos().y-minY)*(maxY-pos().y)/pow(maxY-minY,2);"
            "profileZ=4*(pos().z-minZ)*(maxZ-pos().z)/pow(maxZ-minZ,2);"
        );
        valueExpression "-10*normal()*profileY*profileZ";
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
